trade_exp/src/Documents/АрендаНоменклатуры/АрендаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>АрендаНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="966054c7-5235-482e-b7ef-15ace606ebe4">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c78dceba-50e8-4a3a-a189-e0760aabee53">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c94dfe3d-8911-4256-a142-56e1f43c983d">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95c7f89a-c817-4972-84cf-d247b0380708">
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="00337579-5832-4d28-81cc-32fbfc41ec80">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6edf55c-070b-4085-88b1-42ee5c4ac2e6">
    <name>ДатаСдачиВАренду</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5cb6017c-244e-47bb-9962-3b1ec3a31dcf">
    <name>ДатаВозврата</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="59141cf6-ba27-416a-b77b-31cf9d3d543d">
    <name>СуммаУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fcd1bab2-b145-415d-a939-c3ca529402ef">
    <name>СуммаЗалога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7782ab60-d402-404d-8054-62575936bba4">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bfb71ace-feb4-440a-be59-7c5e4e13b134">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a36040b2-042c-4b2f-96f1-c42e400bc7f3">
    <name>КартаЛояльности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="874bb0b2-2466-4cbf-be1c-093ad26e65c0">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a976ece0-ac77-417e-8b2d-0962b97145c9">
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="277e9b24-4633-4cf3-819b-447bfbf8959d">
    <name>ВозвратОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7d7fce9-a9a8-4b47-8ce8-1df200b57792">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b72c666-ceb1-478a-b71c-104ac8b9e06c">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="ccdb1b7f-3811-4474-8d82-b9392008cb37">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4d570980-c1b7-454e-bf59-c595c475658d">
      <name>ВидЦены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="20c4d67c-cf72-44c7-a6cc-f9347489b7a2">
      <name>ДатаВозврата</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1dee34e4-71aa-48f9-a004-2116675a31ad">
      <name>ЦенаУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6778c420-c4bd-4ba5-bde6-a062087b5271">
      <name>СуммаЗалога</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aac6aef2-88ab-4d3e-8331-c4b02c35eb75">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ccbc682f-b82c-42b9-acb5-dae9839d6c53">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e79414f3-52e7-4477-a11f-1e5f81f0754f">
      <name>УслугаАренды</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d842a7a8-1e16-430f-9c57-f7ef29f5ecd3">
      <name>Период</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9ac114a8-1e27-442e-8a46-45dda0972b02">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="60fb7b62-9cd6-47b6-a642-6696dada9849">
      <name>КоличествоУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1d9739fe-52ea-440d-b9f4-1855645fc816">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="860ca8e7-dc30-498a-9223-564dea61ee2c">
      <name>СуммаСНДСУслуги</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1a4991f8-7832-4ca9-8809-88a97de88749">
  <name>ДокументыФизическихЛиц</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="4f44c1c0-0480-415e-8058-41b28f2f43a0">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="3b708ec7-6543-40ff-8ea2-16d4ddb7d56f">
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="433e502d-ab5c-4e8e-a7c0-0fde1aa6f767">
    <name>ДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6bd65f02-9531-4dd4-bd4a-4132aa3c4787">
    <name>СрокДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d9863e6-aab7-4808-a516-8bc42dae5d01">
    <name>КемВыдан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="a2910bb8-fdd2-480c-8ae2-78661d7d18e0">
    <name>КодПодразделения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="218302fa-674d-45e1-a7e2-2cce2d011342">
    <name>ЯвляетсяДокументомУдостоверяющимЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="70264a0a-95c5-426f-a1bf-0f57b86d4030">
    <name>Представление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="cadcf4bd-2047-4fcb-b58e-bd6c09c5577a">
    <name>ФамилияЛатиницей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="e22a7536-dd59-4093-bfc8-335178b9da44">
    <name>ИмяЛатиницей</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="af40a979-1391-4411-b5a4-9f9a91fb8123">
    <name>СтранаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="365ca951-7fbf-4ad3-9004-47c3ef48b3bd">
    <name>КатегорииТранспортныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="a231846e-d31a-4f94-9c9f-1e18d525af6c">
    <name>АдресПрописки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ac3dc5c4-e172-49f9-b95f-4221e68f3600">
    <name>АдресПроживания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0495d913-3a33-41b9-9065-56d730c8fc56">
    <name>СовпадаетСПропиской</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="3291428e-6727-43cc-a1f8-c62f90320e90">
    <name>Физлицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="d867720c-c937-4689-b241-0afda05ef993">
    <name>ВидДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="45974ccb-45ed-4235-b8ff-abc37bb5c45b">
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2e46dee0-b40d-4bd4-b02a-da83a286ea45">
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/КомпанияЧастноеЛицо/КомпанияЧастноеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КомпанияЧастноеЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="640f3f70-7e8d-48fb-8487-fda65cb57f60">
    <name>ЧастноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af9cb34d-d5ea-4de1-a7d6-999e6bd67541">
    <name>Компания</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыДоговоровКонтрагентов/СтатусыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3915309e-1c9c-447e-82d1-cd037c7784b2">
    <name>НеСогласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26b5dc0e-bfd2-43c0-b272-c13aae125257">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыДоговоров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="7167043e-3ed3-411a-a338-9e59ecb123f5">
    <name>СПокупателем</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="81324e26-995c-4379-af71-5ad2721ba02b">
    <name>СДавальцем2_5</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/АрендаНоменклатуры/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	УстановитьВидимостьДоступностьНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Элементы.ДатаВозврата.Доступность= Объект.ВозвратОднойДатой;
	Элементы.ТоварыКоличествоУслуги.Доступность= Не Объект.ВозвратОднойДатой;
	
	СуммаВнесенногоЗалога= Документы.АрендаНоменклатуры.ПолучитьСуммуВнесенногоЗаолога(Объект.Ссылка);
	Если Объект.СуммаЗалога > 0 Тогда
		ПроцентВнесенногоЗалога= 100*СуммаВнесенногоЗалога/Объект.СуммаЗалога;
	Иначе
		ПроцентВнесенногоЗалога= 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			СтруктураДанных= МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			Штрихкод= СокрЛП(СтруктураДанных.Штрихкод);
			
			Если АльтерраОбщегоНазначенияКлиент.ЭтоШтрихкодКартыЛояльности(Штрихкод) Тогда //3. Карта лояльности
				КартыЛояльности = КартыЛояльностиВызовСервера.НайтиКартыЛояльностиПоШтрихкоду(Штрихкод);
				Если КартыЛояльности.ЗарегистрированныеКартыЛояльности.Количество() > 0 Тогда 
					КартаЛояльности= КартыЛояльности.ЗарегистрированныеКартыЛояльности[0];
					Если КартаЛояльности.Статус = АльтерраОбщегоНазначения.ПолучитьСтатусКартыЛояльностиДействует() Тогда
						Объект.КартаЛояльности= КартаЛояльности.Ссылка;
						КартаЛояльностиПриИзмененииНаСервере();
					Иначе
						ТекстСообщения = НСтр("ru = 'Карта со штрихкодом %1 аннулирована. Зарегистрируйте карту с помощью помощника регистрации карт лояльности'");
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Штрихкод), , "Объект.КартаЛояльности");
					КонецЕсли
				Иначе 
					ТекстСообщения = НСтр("ru = 'Карта со штрихкодом %1 не зарегистрирована. Карты регистрируются только с помощью помощника регистрации карт лояльности'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Штрихкод), , "Объект.КартаЛояльности");
				КонецЕсли;
			ИначеЕсли СтрДлина(Штрихкод) <= 30 Тогда //4. Номенклатура
				ДобавитьТовар(Штрихкод);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "СчитанаКартаЛояльности"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		Объект.КартаЛояльности= Параметр.КартаЛояльности;
		КартаЛояльностиПриИзмененииНаСервере();
	КонецЕсли;

	Если ИмяСобытия = "СчитанПартнер" И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		Объект.Партнер = Параметр.Партнер;
		ПартнерПриИзменении(Неопределено);
	КонецЕсли;	
КонецПроцедуры

&НаСервере


&НаСервере
Процедура ДобавитьТовар(Штрихкод)
	Рез= Новый Структура("Номенклатура,Характеристика");
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	|	1 КАК Количество,
	|	1 КАК КоличествоУслуги
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Выборка= РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		НоваяСтрока= Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		ЗаполнитьСтрокуНаСервере(НоваяСтрока.НомерСтроки-1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПерезаполнитьСтрокиТовараНаСервере();
	ЗаполнитьДоговор();
КонецПроцедуры
#КонецОбласти


#Область ПересчетыВидимость
&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
КонецПроцедуры
&НаСервере
Процедура УстановитьВидимостьДоступностьНаСервере()
	ЭтаФорма.ТолькоПросмотр= (Объект.Статус = Перечисления.СтатусыАренды.Выполнен) ИЛИ (Объект.Статус = Перечисления.СтатусыАренды.ВАренде);
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьИтоги()
	Объект.СуммаУслуг= Объект.Товары.Итог("СуммаСНДСУслуги");	
	Объект.СуммаЗалога= Объект.Товары.Итог("СуммаЗалога");	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьСтрокиТовараНаСервере()
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ЗаполнитьСтрокуНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры  

#КонецОбласти

#Область ТЧТовары
&НаСервере
Процедура ЗаполнитьСтрокуНаСервере(НомерСтроки)
	ТекущаяСтрока= Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
	
	СтавкаНДС=УчетНДСУП.СтавкаНДСПоУмолчанию(Объект.Организация,Объект.Дата);
	если значениезаполнено(СтавкаНДС) тогда
	ТекущаяСтрока.СтавкаНДС =СтавкаНДС.ПеречислениеСтавкаНДС;
	иначе
	ТекущаяСтрока.СтавкаНДС =Перечисления.СтавкиНДС.БезНДС;	
	конецесли;	
	ТекущаяСтрока.УслугаАренды = ТекущаяСтрока.Номенклатура.УслугаАренды;
	
	Если Не ЗначениеЗаполнено(ТекущаяСтрока.Период) Тогда
		ТекущаяСтрока.Период= "Сутки";
	КонецЕсли;
	
	Если ТекущаяСтрока.Количество = 0 Тогда
		 ТекущаяСтрока.Количество= 1;
	КонецЕсли;
	
	Если ТекущаяСтрока.КоличествоУслуги = 0 Тогда
		 ТекущаяСтрока.КоличествоУслуги= 1;
	КонецЕсли;

	ТекущаяСтрока.ВидЦены= ПодборТоваровВызовСервера.ВернутьВидЦенПоПараметрам(Объект.Соглашение.ГруппаВидовЦен,Объект.Подразделение);

	ТекущаяСтрока.ЦенаУслуги= Документы.АрендаНоменклатуры.ПолучитьЦену(ТекущаяСтрока.УслугаАренды, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ТекущаяСтрока.ВидЦены);
	
	ПересчитатьСтрокуУслуги(НомерСтроки); 
	
	
КонецПроцедуры
&НаСервере
Процедура ПересчитатьСтрокуУслуги(НомерСтроки)
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(НомерСтроки);
	ТекущаяСтрока.СуммаУслуги = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаУслуги * ТекущаяСтрока.КоличествоУслуги;
	ТекущаяСтрока.СуммаЗалога = ТекущаяСтрока.Количество * ТекущаяСтрока.ЦенаУслуги * 7;
	ТекущаяСтрока.СуммаСНДСУслуги = ТекущаяСтрока.СуммаУслуги;
	ТекущаяСтрока.ДатаВозврата = Объект.ДатаСдачиВАренду + ТекущаяСтрока.КоличествоУслуги * 3600 * 24;  
	
	Объект.СуммаУслуг= Объект.Товары.Итог("СуммаСНДСУслуги");	
	Объект.СуммаЗалога= Объект.Товары.Итог("СуммаЗалога");	

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока= Элементы.Товары.ТекущаяСтрока;
	ПересчитатьСтрокуУслуги(ТекущаяСтрока);
КонецПроцедуры
&НаКлиенте
Процедура ТоварыКоличествоУслугиПриИзменении(Элемент)
	ТекущаяСтрока= Элементы.Товары.ТекущаяСтрока;
	ПересчитатьСтрокуУслуги(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока= Элементы.Товары.ТекущаяСтрока;
	ЗаполнитьСтрокуНаСервере(ТекущаяСтрока);  
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУслугаАрендыПриИзменении(Элемент)
	ТекущаяСтрока= Элементы.Товары.ТекущаяСтрока;
	ЗаполнитьСтрокуНаСервере(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура Подобрать(Команда)
	Оповещение= Новый ОписаниеОповещения("ПодборТовараЗавершение", ЭтаФорма);
	ПараметрыОткрытия= Новый Структура;
	ПараметрыОткрытия.Вставить("Склад", Объект.Склад);
	
	ОткрытьФорму("Документ.АрендаНоменклатуры.Форма.ПодборНоменклатуры", ПараметрыОткрытия, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПодборТовараЗавершение(Результат, ДопПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		НоваяСтрока= Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура= Результат.Номенклатура;
		НоваяСтрока.Характеристика= Результат.Характеристика;
		ЗаполнитьСтрокуНаСервере(НоваяСтрока.ПолучитьИдентификатор()); 
		РассчитатьИтоги();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СобытияШапки

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	Попытка
		ПартнерЭтоКомпанияОбработка();
	Исключение
		возврат;
	КонецПопытки;
	ПартнерПриИзмененииНаСервере();
	РассчитатьИтоги(); 
	ЗаполнитьДоговор();
КонецПроцедуры
&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	Объект.Контрагент= АльтерраОбщегоНазначения.ПолучитьЕдинственногоКонтрагента(Объект.Партнер);
	Объект.КартаЛояльности= АльтерраОбщегоНазначения.ПолучитьКартуЛояльности(Объект.Партнер);
	Объект.Соглашение = АльтерраОбщегоНазначения.ПолучитьСоглашениеПоУмолчанию(Объект.Партнер, Объект.Подразделение, Объект.КартаЛояльности, Объект.Дата);
	ПерезаполнитьСтрокиТовараНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПартнерЭтоКомпанияОбработка()
    Если Объект.Партнер.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания Тогда
		ТекстСообщения = "%Клиент% - компания, аренда номенклатур для юридических лиц запрещена!";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Клиент%", Объект.Партнер.Наименование);
		Сообщить(ТекстСообщения);
		//Обнуляем выбор если было выбрано Юр. лицо
		Объект.Партнер = Справочники.Партнеры.ПустаяСсылка();
		ВызватьИсключение("Ошибка выбора клиента при заполнении документа Аренда Номенклатуры");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	
	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = Объект.Партнер;
	ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
	ПараметрыВыбораСоглашения.ДатаДокумента               = ТекущаяДата();
	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = ЭтаФорма.Объект;
	
	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)
	ПерезаполнитьСтрокиТовараНаСервере();
	РассчитатьИтоги();
КонецПроцедуры

&НаСервере
Процедура КартаЛояльностиПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) Тогда
		Объект.Партнер= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КартаЛояльности, "Партнер");
		Попытка
			ПартнерЭтоКомпанияОбработка();
		Исключение
			возврат;
		КонецПопытки;
		Объект.Контрагент= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КартаЛояльности, "Контрагент");
		Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Объект.Контрагент= АльтерраОбщегоНазначения.ПолучитьЕдинственногоКонтрагента(Объект.Партнер);
		КонецЕсли;
		Объект.Соглашение = АльтерраОбщегоНазначения.ПолучитьСоглашениеПоУмолчанию(Объект.Партнер, Объект.Подразделение, Объект.КартаЛояльности, Объект.Дата);
		
		ПерезаполнитьСтрокиТовараНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СчитатьКартуЛояльности(Команда)
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Партнер", Объект.Партнер);
	ПараметрыОткрытия.Вставить("НеПодключатьОборудование", Ложь);
	
	ОткрытьФорму(
		"Справочник.КартыЛояльности.Форма.СчитываниеКартыЛояльности",
		ПараметрыОткрытия,
		ЭтотОбъект,
		УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументыФизЛица(Команда)
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Физлицо", Объект.Контрагент));
		ОткрытьФорму("РегистрСведений.ДокументыФизическихЛиц.Форма.ДокументыФизическогоЛица", ПараметрыФормы);
	Иначе
		Сообщить("Заполните контрагента", СтатусСообщения.ОченьВажное);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьВидимостьДоступностьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВозвратОднойДатойПриИзменении(Элемент)
	Элементы.ДатаВозврата.Доступность= Объект.ВозвратОднойДатой;
	Элементы.ТоварыКоличествоУслуги.Доступность= Не Объект.ВозвратОднойДатой;

	ДатаВозвратаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ДатаВозвратаПриИзменении(Элемент)
	Если Объект.ВозвратОднойДатой Тогда
		Для Каждого стрТовар Из Объект.Товары Цикл
			стрТовар.ДатаВозврата= Объект.ДатаВозврата;
			
			КоличествоУслуги= (стрТовар.ДатаВозврата-Объект.ДатаСдачиВАренду)/(3600*24);
			КоличествоУслуги= ?(КоличествоУслуги<1, 1, КоличествоУслуги);
			КоличествоУслуги= ?(Цел(КоличествоУслуги) < КоличествоУслуги, Цел(КоличествоУслуги)+1, КоличествоУслуги);
			
			стрТовар.КоличествоУслуги= Цел(КоличествоУслуги);
			
			ПересчитатьСтрокуУслуги(стрТовар.ПолучитьИдентификатор());
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ДатаСдачиВАрендуПриИзменении(Элемент)
		Для Каждого стрТовар Из Объект.Товары Цикл
			стрТовар.КоличествоУслуги= (стрТовар.ДатаВозврата-Объект.ДатаСдачиВАренду)/(3600*24);
			ПересчитатьСтрокуУслуги(стрТовар.ПолучитьИдентификатор());
		КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область Статусы

&НаКлиенте
Процедура КЗаказу(Команда)
	//Если ЭтаФорма.Модифицированность ИЛИ Не Объект.Проведен Тогда
	//	Оповещение= Новый ОписаниеОповещения("ВопросОЗаписиЗавершение", ЭтотОбъект);
	//	ПоказатьВопрос(Оповещение, "Сначало необходимо провести документ. Провести?", РежимДиалогаВопрос.ДаНет, 5, , "Провести документ ...");
	//Иначе
	//	КЗаказуНаСервере();
	//КонецЕсли;		
	
	КЗаказуНаСервере();
КонецПроцедуры
&НаСервере
Процедура КЗаказуНаСервере()
	Если Объект.Статус <> Перечисления.СтатусыАренды.Выполнен Тогда
		ПредыдущийСтатус= Объект.Статус;
		Отказ= Ложь;
		НачатьТранзакцию();
		
		Объект.Статус= Перечисления.СтатусыАренды.КЗаказу;
		
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		
		Документы.АрендаНоменклатуры.УдалитьДокументПеремещение(Объект.Ссылка, Отказ);
		
		Если Не Отказ Тогда
			ЗафиксироватьТранзакцию();
			УстановитьВидимостьДоступностьНаСервере();
		Иначе
			Объект.Статус= ПредыдущийСтатус;
			ОтменитьТранзакцию();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВАренду(Команда)
	ВАрендуНаСервере();
КонецПроцедуры
&НаСервере
Процедура ВАрендуНаСервере()
	Если Объект.Статус <> Перечисления.СтатусыАренды.Выполнен Тогда
		//ПредыдущийСтатус= Объект.Статус;
		Отказ= Ложь;
		
		Если Объект.Ссылка.Пустая() Тогда		
			Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Объект.Статус= Перечисления.СтатусыАренды.ВАренде;		
		
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		
		Документы.АрендаНоменклатуры.СоздатьДокументПеремещение(Объект.Ссылка, Отказ);	
		
		Если Не Отказ Тогда
			ЗафиксироватьТранзакцию();
			УстановитьВидимостьДоступностьНаСервере();
		Иначе
			ОтменитьТранзакцию();
			ЭтотОбъект.Прочитать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	ОтменитьНаСервере();
КонецПроцедуры
&НаСервере
Процедура ОтменитьНаСервере()
	Отказ= Ложь;
	
	Если Объект.Статус <> Перечисления.СтатусыАренды.Выполнен Тогда
		ПредыдущийСтатус= Объект.Статус;
		НачатьТранзакцию();
		
		Объект.Статус= Перечисления.СтатусыАренды.Отменен;

		//Записать();
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		
		Документы.АрендаНоменклатуры.УдалитьДокументПеремещение(Объект.Ссылка, Отказ);
		
		Если Не Отказ Тогда
			ЗафиксироватьТранзакцию();
			УстановитьВидимостьДоступностьНаСервере();
		Иначе
			Объект.Статус= ПредыдущийСтатус;
			ОтменитьТранзакцию();
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПерезаполнитьСтрокиТовараНаСервере();
КонецПроцедуры

#КонецОбласти 


#Область СозданиеДоговора 

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ЗаполнитьДоговор();
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьДоговор()
	ЗаполнитьДоговорНаСервере();
	Если Не ЗначениеЗаполнено(Объект.Договор) Тогда
		Оповещение = Новый ОписаниеОповещения("ЗаполнениеДоговораЗавершение", ЭтаФорма);
       	ТекстВопроса = "По контрагенту нет действующего договора аренды. Создать новый?";
       	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);	
	КонецЕсли;
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДоговорНаСервере()
	Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Если ЗначениеЗаполнено(Объект.Партнер) и ЗначениеЗаполнено(Объект.Контрагент) и ЗначениеЗаполнено(Объект.Организация) Тогда
				
		ДоговорАренды = ПолучитьДоговор("Аренда");
		
		Если ДоговорАренды = Неопределено Тогда
			ДоговорАренды = ПолучитьДоговор("%Аренд%");
			Объект.Договор = ?(ДоговорАренды <> Неопределено , ДоговорАренды, Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
		Иначе
			Объект.Договор = ДоговорАренды;
		КонецЕсли; 			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнениеДоговораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да тогда
		СоздатьДоговорНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДоговор(Наименование)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Организация = &Организация 
		|	И ДоговорыКонтрагентов.Партнер = &Партнер
		|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
		|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И ДоговорыКонтрагентов.Статус = Значение(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
		|	И ДоговорыКонтрагентов.Наименование ПОДОБНО &Наименование ";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
    Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Возврат Выборка.ссылка;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
	
    

КонецФункции

&НаСервере
Функция ПолучитьДанныеЗаполнения()
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ТипДоговора", Перечисления.ТипыДоговоров.СПокупателем);
	ЗначенияЗаполнения.Вставить("Наименование", "Аренда");
	ЗначенияЗаполнения.Вставить("НаименованиеДляПечати", "Аренда");
	ЗначенияЗаполнения.Вставить("Партнер", Объект.Партнер);
	ЗначенияЗаполнения.Вставить("Контрагент", Объект.Контрагент); 
	ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
	ЗначенияЗаполнения.Вставить("ВидДоговора", Перечисления.ВидДоговора.Предоплата);
	ЗначенияЗаполнения.Вставить("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.РеализацияКлиенту);	
    Возврат ЗначенияЗаполнения

КонецФункции


&НаСервере
Процедура СоздатьДоговорНаСервере()
	ЗначенияЗаполнения = ПолучитьДанныеЗаполнения();  
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовыйДоговор.Заполнить(ЗначенияЗаполнения);
	НовыйДоговор.Наименование = ЗначенияЗаполнения.Наименование;
	НовыйДоговор.НаименованиеДляПечати = ЗначенияЗаполнения.НаименованиеДляПечати;
	НовыйДоговор.ВидДоговора = ЗначенияЗаполнения.ВидДоговора;
	НовыйДоговор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	НовыйДоговор.Записать();
	Объект.Договор = НовыйДоговор.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДоговор(Команда)
	СоздатьДоговорНаСервере();
	
КонецПроцедуры 

&НаСервере
функция ПолучитьСтатусДоговора()
   Возврат Перечисления.СтатусыДоговоровКонтрагентов.Действует;
КонецФункции

#КонецОбласти
